Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_eeprom_write_read/firmware/src/packs/ATSAML10E16A_DFP/component/fpb.h
/**
 * \brief Component description for FPB
 *
 * © 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-05-31T10:20:47Z */
#ifndef _SAML10_FPB_COMPONENT_H_
#define _SAML10_FPB_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FPB                                          */
/* ************************************************************************** */

/* -------- FPB_FP_CTRL : (FPB Offset: 0x00) (R/W 32) Flash Patch Control Register -------- */
#define FPB_FP_CTRL_ENABLE_Pos                _U_(0)                                         /**< (FPB_FP_CTRL) Flash Patch global enable Position */
#define FPB_FP_CTRL_ENABLE_Msk                (_U_(0x1) << FPB_FP_CTRL_ENABLE_Pos)           /**< (FPB_FP_CTRL) Flash Patch global enable Mask */
#define FPB_FP_CTRL_KEY_Pos                   _U_(1)                                         /**< (FPB_FP_CTRL) FP_CTRL write-enable key Position */
#define FPB_FP_CTRL_KEY_Msk                   (_U_(0x1) << FPB_FP_CTRL_KEY_Pos)              /**< (FPB_FP_CTRL) FP_CTRL write-enable key Mask */
#define FPB_FP_CTRL_NUM_CODE_Pos              _U_(4)                                         /**< (FPB_FP_CTRL) Number of implemented code comparators bits [3:0] Position */
#define FPB_FP_CTRL_NUM_CODE_Msk              (_U_(0xF) << FPB_FP_CTRL_NUM_CODE_Pos)         /**< (FPB_FP_CTRL) Number of implemented code comparators bits [3:0] Mask */
#define FPB_FP_CTRL_NUM_CODE(value)           (FPB_FP_CTRL_NUM_CODE_Msk & ((value) << FPB_FP_CTRL_NUM_CODE_Pos))
#define FPB_FP_CTRL_NUM_LIT_Pos               _U_(8)                                         /**< (FPB_FP_CTRL) Number of literal comparators Position */
#define FPB_FP_CTRL_NUM_LIT_Msk               (_U_(0xF) << FPB_FP_CTRL_NUM_LIT_Pos)          /**< (FPB_FP_CTRL) Number of literal comparators Mask */
#define FPB_FP_CTRL_NUM_LIT(value)            (FPB_FP_CTRL_NUM_LIT_Msk & ((value) << FPB_FP_CTRL_NUM_LIT_Pos))
#define FPB_FP_CTRL_NUM_CODE_1_Pos            _U_(12)                                        /**< (FPB_FP_CTRL) Number of implemented code comparators bits [6:4] Position */
#define FPB_FP_CTRL_NUM_CODE_1_Msk            (_U_(0x7) << FPB_FP_CTRL_NUM_CODE_1_Pos)       /**< (FPB_FP_CTRL) Number of implemented code comparators bits [6:4] Mask */
#define FPB_FP_CTRL_NUM_CODE_1(value)         (FPB_FP_CTRL_NUM_CODE_1_Msk & ((value) << FPB_FP_CTRL_NUM_CODE_1_Pos))
#define FPB_FP_CTRL_REV_Pos                   _U_(28)                                        /**< (FPB_FP_CTRL) Revision Position */
#define FPB_FP_CTRL_REV_Msk                   (_U_(0xF) << FPB_FP_CTRL_REV_Pos)              /**< (FPB_FP_CTRL) Revision Mask */
#define FPB_FP_CTRL_REV(value)                (FPB_FP_CTRL_REV_Msk & ((value) << FPB_FP_CTRL_REV_Pos))
#define FPB_FP_CTRL_Msk                       _U_(0xF0007FF3)                                /**< (FPB_FP_CTRL) Register Mask  */


/* -------- FPB_FP_REMAP : (FPB Offset: 0x04) ( R/ 32) Flash Patch Remap Register -------- */
#define FPB_FP_REMAP_REMAP_Pos                _U_(5)                                         /**< (FPB_FP_REMAP) Remap address Position */
#define FPB_FP_REMAP_REMAP_Msk                (_U_(0xFFFFFF) << FPB_FP_REMAP_REMAP_Pos)      /**< (FPB_FP_REMAP) Remap address Mask */
#define FPB_FP_REMAP_REMAP(value)             (FPB_FP_REMAP_REMAP_Msk & ((value) << FPB_FP_REMAP_REMAP_Pos))
#define FPB_FP_REMAP_RMPSPT_Pos               _U_(29)                                        /**< (FPB_FP_REMAP) Remap supported Position */
#define FPB_FP_REMAP_RMPSPT_Msk               (_U_(0x1) << FPB_FP_REMAP_RMPSPT_Pos)          /**< (FPB_FP_REMAP) Remap supported Mask */
#define FPB_FP_REMAP_Msk                      _U_(0x3FFFFFE0)                                /**< (FPB_FP_REMAP) Register Mask  */


/* -------- FPB_FP_COMP : (FPB Offset: 0x08) (R/W 32) Flash Patch Comparator Register n -------- */
#define FPB_FP_COMP_BE_Pos                    _U_(0)                                         /**< (FPB_FP_COMP) Breakpoint enable Position */
#define FPB_FP_COMP_BE_Msk                    (_U_(0x1) << FPB_FP_COMP_BE_Pos)               /**< (FPB_FP_COMP) Breakpoint enable Mask */
#define FPB_FP_COMP_FPADDR_Pos                _U_(2)                                         /**< (FPB_FP_COMP) Flash Patch address Position */
#define FPB_FP_COMP_FPADDR_Msk                (_U_(0x7FFFFFF) << FPB_FP_COMP_FPADDR_Pos)     /**< (FPB_FP_COMP) Flash Patch address Mask */
#define FPB_FP_COMP_FPADDR(value)             (FPB_FP_COMP_FPADDR_Msk & ((value) << FPB_FP_COMP_FPADDR_Pos))
#define FPB_FP_COMP_FE_Pos                    _U_(31)                                        /**< (FPB_FP_COMP) Flash Patch enable Position */
#define FPB_FP_COMP_FE_Msk                    (_U_(0x1) << FPB_FP_COMP_FE_Pos)               /**< (FPB_FP_COMP) Flash Patch enable Mask */
#define FPB_FP_COMP_Msk                       _U_(0x9FFFFFFD)                                /**< (FPB_FP_COMP) Register Mask  */

/* BREAKPOINT mode */
#define FPB_FP_COMP_BREAKPOINT_BPADDR_Pos     _U_(1)                                         /**< (FPB_FP_COMP) Breakpoint address Position */
#define FPB_FP_COMP_BREAKPOINT_BPADDR_Msk     (_U_(0x7FFFFFFF) << FPB_FP_COMP_BREAKPOINT_BPADDR_Pos) /**< (FPB_FP_COMP) Breakpoint address Mask */
#define FPB_FP_COMP_BREAKPOINT_BPADDR(value)  (FPB_FP_COMP_BREAKPOINT_BPADDR_Msk & ((value) << FPB_FP_COMP_BREAKPOINT_BPADDR_Pos))
#define FPB_FP_COMP_BREAKPOINT_Msk          _U_(0xFFFFFFFE)                                 /**< (FPB_FP_COMP_BREAKPOINT) Register Mask  */


