Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_eeprom_write_read/firmware/src/packs/ATSAML10E16A_DFP/component/fpb.h
/* -------- FPB_FP_LAR : (FPB Offset: 0xFB0) ( /W 32) FPB Software Lock Access Register -------- */
#define FPB_FP_LAR_KEY_Pos                    _U_(0)                                         /**< (FPB_FP_LAR) Lock access control Position */
#define FPB_FP_LAR_KEY_Msk                    (_U_(0xFFFFFFFF) << FPB_FP_LAR_KEY_Pos)        /**< (FPB_FP_LAR) Lock access control Mask */
#define FPB_FP_LAR_KEY(value)                 (FPB_FP_LAR_KEY_Msk & ((value) << FPB_FP_LAR_KEY_Pos))
#define   FPB_FP_LAR_KEY_UNLOCK_Val           _U_(0xC5ACCE55)                                /**< (FPB_FP_LAR) Unlock key value  */
#define FPB_FP_LAR_KEY_UNLOCK                 (FPB_FP_LAR_KEY_UNLOCK_Val << FPB_FP_LAR_KEY_Pos) /**< (FPB_FP_LAR) Unlock key value Position  */
#define FPB_FP_LAR_Msk                        _U_(0xFFFFFFFF)                                /**< (FPB_FP_LAR) Register Mask  */


/* -------- FPB_FP_LSR : (FPB Offset: 0xFB4) ( R/ 32) FPB Software Lock Status Register -------- */
#define FPB_FP_LSR_SLI_Pos                    _U_(0)                                         /**< (FPB_FP_LSR) Software Lock implemented Position */
#define FPB_FP_LSR_SLI_Msk                    (_U_(0x1) << FPB_FP_LSR_SLI_Pos)               /**< (FPB_FP_LSR) Software Lock implemented Mask */
#define FPB_FP_LSR_SLK_Pos                    _U_(1)                                         /**< (FPB_FP_LSR) Software Lock status Position */
#define FPB_FP_LSR_SLK_Msk                    (_U_(0x1) << FPB_FP_LSR_SLK_Pos)               /**< (FPB_FP_LSR) Software Lock status Mask */
#define FPB_FP_LSR_nTT_Pos                    _U_(2)                                         /**< (FPB_FP_LSR) Not thirty-two bit Position */
#define FPB_FP_LSR_nTT_Msk                    (_U_(0x1) << FPB_FP_LSR_nTT_Pos)               /**< (FPB_FP_LSR) Not thirty-two bit Mask */
#define FPB_FP_LSR_Msk                        _U_(0x00000007)                                /**< (FPB_FP_LSR) Register Mask  */


/* -------- FPB_FP_DEVARCH : (FPB Offset: 0xFBC) ( R/ 32) FPB Device Architecture Register -------- */
#define FPB_FP_DEVARCH_RESETVALUE           _U_(0x47701A03)                               /**<  (FPB_FP_DEVARCH) FPB Device Architecture Register  Reset Value */

#define FPB_FP_DEVARCH_ARCHPART_Pos           _U_(0)                                         /**< (FPB_FP_DEVARCH) Architecture Part Position */
#define FPB_FP_DEVARCH_ARCHPART_Msk           (_U_(0xFFF) << FPB_FP_DEVARCH_ARCHPART_Pos)    /**< (FPB_FP_DEVARCH) Architecture Part Mask */
#define FPB_FP_DEVARCH_ARCHPART(value)        (FPB_FP_DEVARCH_ARCHPART_Msk & ((value) << FPB_FP_DEVARCH_ARCHPART_Pos))
#define FPB_FP_DEVARCH_ARCHVER_Pos            _U_(12)                                        /**< (FPB_FP_DEVARCH) Architecture Version Position */
#define FPB_FP_DEVARCH_ARCHVER_Msk            (_U_(0xF) << FPB_FP_DEVARCH_ARCHVER_Pos)       /**< (FPB_FP_DEVARCH) Architecture Version Mask */
#define FPB_FP_DEVARCH_ARCHVER(value)         (FPB_FP_DEVARCH_ARCHVER_Msk & ((value) << FPB_FP_DEVARCH_ARCHVER_Pos))
#define FPB_FP_DEVARCH_REVISION_Pos           _U_(16)                                        /**< (FPB_FP_DEVARCH) Revision Position */
#define FPB_FP_DEVARCH_REVISION_Msk           (_U_(0xF) << FPB_FP_DEVARCH_REVISION_Pos)      /**< (FPB_FP_DEVARCH) Revision Mask */
#define FPB_FP_DEVARCH_REVISION(value)        (FPB_FP_DEVARCH_REVISION_Msk & ((value) << FPB_FP_DEVARCH_REVISION_Pos))
#define FPB_FP_DEVARCH_PRESENT_Pos            _U_(20)                                        /**< (FPB_FP_DEVARCH) DEVARCH Present Position */
#define FPB_FP_DEVARCH_PRESENT_Msk            (_U_(0x1) << FPB_FP_DEVARCH_PRESENT_Pos)       /**< (FPB_FP_DEVARCH) DEVARCH Present Mask */
#define FPB_FP_DEVARCH_ARCHITECT_Pos          _U_(21)                                        /**< (FPB_FP_DEVARCH) Architect Position */
#define FPB_FP_DEVARCH_ARCHITECT_Msk          (_U_(0x7FF) << FPB_FP_DEVARCH_ARCHITECT_Pos)   /**< (FPB_FP_DEVARCH) Architect Mask */
#define FPB_FP_DEVARCH_ARCHITECT(value)       (FPB_FP_DEVARCH_ARCHITECT_Msk & ((value) << FPB_FP_DEVARCH_ARCHITECT_Pos))
#define FPB_FP_DEVARCH_Msk                    _U_(0xFFFFFFFF)                                /**< (FPB_FP_DEVARCH) Register Mask  */


/* -------- FPB_FP_DEVTYPE : (FPB Offset: 0xFCC) ( R/ 32) FPB Device Type Register -------- */
#define FPB_FP_DEVTYPE_RESETVALUE           _U_(0x00)                                     /**<  (FPB_FP_DEVTYPE) FPB Device Type Register  Reset Value */

#define FPB_FP_DEVTYPE_MAJOR_Pos              _U_(0)                                         /**< (FPB_FP_DEVTYPE) Major type Position */
#define FPB_FP_DEVTYPE_MAJOR_Msk              (_U_(0xF) << FPB_FP_DEVTYPE_MAJOR_Pos)         /**< (FPB_FP_DEVTYPE) Major type Mask */
#define FPB_FP_DEVTYPE_MAJOR(value)           (FPB_FP_DEVTYPE_MAJOR_Msk & ((value) << FPB_FP_DEVTYPE_MAJOR_Pos))
#define FPB_FP_DEVTYPE_SUB_Pos                _U_(4)                                         /**< (FPB_FP_DEVTYPE) Sub-type Position */
#define FPB_FP_DEVTYPE_SUB_Msk                (_U_(0xF) << FPB_FP_DEVTYPE_SUB_Pos)           /**< (FPB_FP_DEVTYPE) Sub-type Mask */
#define FPB_FP_DEVTYPE_SUB(value)             (FPB_FP_DEVTYPE_SUB_Msk & ((value) << FPB_FP_DEVTYPE_SUB_Pos))
#define FPB_FP_DEVTYPE_Msk                    _U_(0x000000FF)                                /**< (FPB_FP_DEVTYPE) Register Mask  */


/* -------- FPB_FP_PIDR4 : (FPB Offset: 0xFD0) ( R/ 32) FP Peripheral Identification Register 4 -------- */
#define FPB_FP_PIDR4_DES_2_Pos                _U_(0)                                         /**< (FPB_FP_PIDR4) JEP106 continuation code Position */
#define FPB_FP_PIDR4_DES_2_Msk                (_U_(0xF) << FPB_FP_PIDR4_DES_2_Pos)           /**< (FPB_FP_PIDR4) JEP106 continuation code Mask */
#define FPB_FP_PIDR4_DES_2(value)             (FPB_FP_PIDR4_DES_2_Msk & ((value) << FPB_FP_PIDR4_DES_2_Pos))
#define FPB_FP_PIDR4_SIZE_Pos                 _U_(4)                                         /**< (FPB_FP_PIDR4) 4KB count Position */
#define FPB_FP_PIDR4_SIZE_Msk                 (_U_(0xF) << FPB_FP_PIDR4_SIZE_Pos)            /**< (FPB_FP_PIDR4) 4KB count Mask */
#define FPB_FP_PIDR4_SIZE(value)              (FPB_FP_PIDR4_SIZE_Msk & ((value) << FPB_FP_PIDR4_SIZE_Pos))
#define FPB_FP_PIDR4_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_PIDR4) Register Mask  */


