Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_eeprom_write_read/firmware/src/packs/ATSAML10E16A_DFP/component/fpb.h
/* -------- FPB_FP_PIDR5 : (FPB Offset: 0xFD4) ( R/ 32) FP Peripheral Identification Register 5 -------- */
#define FPB_FP_PIDR5_RESETVALUE             _U_(0x00)                                     /**<  (FPB_FP_PIDR5) FP Peripheral Identification Register 5  Reset Value */

#define FPB_FP_PIDR5_Msk                      _U_(0x00000000)                                /**< (FPB_FP_PIDR5) Register Mask  */


/* -------- FPB_FP_PIDR6 : (FPB Offset: 0xFD8) ( R/ 32) FP Peripheral Identification Register 6 -------- */
#define FPB_FP_PIDR6_RESETVALUE             _U_(0x00)                                     /**<  (FPB_FP_PIDR6) FP Peripheral Identification Register 6  Reset Value */

#define FPB_FP_PIDR6_Msk                      _U_(0x00000000)                                /**< (FPB_FP_PIDR6) Register Mask  */


/* -------- FPB_FP_PIDR7 : (FPB Offset: 0xFDC) ( R/ 32) FP Peripheral Identification Register 7 -------- */
#define FPB_FP_PIDR7_RESETVALUE             _U_(0x00)                                     /**<  (FPB_FP_PIDR7) FP Peripheral Identification Register 7  Reset Value */

#define FPB_FP_PIDR7_Msk                      _U_(0x00000000)                                /**< (FPB_FP_PIDR7) Register Mask  */


/* -------- FPB_FP_PIDR0 : (FPB Offset: 0xFE0) ( R/ 32) FP Peripheral Identification Register 0 -------- */
#define FPB_FP_PIDR0_PART_0_Pos               _U_(0)                                         /**< (FPB_FP_PIDR0) Part number bits[7:0] Position */
#define FPB_FP_PIDR0_PART_0_Msk               (_U_(0xFF) << FPB_FP_PIDR0_PART_0_Pos)         /**< (FPB_FP_PIDR0) Part number bits[7:0] Mask */
#define FPB_FP_PIDR0_PART_0(value)            (FPB_FP_PIDR0_PART_0_Msk & ((value) << FPB_FP_PIDR0_PART_0_Pos))
#define FPB_FP_PIDR0_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_PIDR0) Register Mask  */


/* -------- FPB_FP_PIDR1 : (FPB Offset: 0xFE4) ( R/ 32) FP Peripheral Identification Register 1 -------- */
#define FPB_FP_PIDR1_PART_1_Pos               _U_(0)                                         /**< (FPB_FP_PIDR1) Part number bits[11:8] Position */
#define FPB_FP_PIDR1_PART_1_Msk               (_U_(0xF) << FPB_FP_PIDR1_PART_1_Pos)          /**< (FPB_FP_PIDR1) Part number bits[11:8] Mask */
#define FPB_FP_PIDR1_PART_1(value)            (FPB_FP_PIDR1_PART_1_Msk & ((value) << FPB_FP_PIDR1_PART_1_Pos))
#define FPB_FP_PIDR1_DES_0_Pos                _U_(4)                                         /**< (FPB_FP_PIDR1) JEP106 identification code bits [3:0] Position */
#define FPB_FP_PIDR1_DES_0_Msk                (_U_(0xF) << FPB_FP_PIDR1_DES_0_Pos)           /**< (FPB_FP_PIDR1) JEP106 identification code bits [3:0] Mask */
#define FPB_FP_PIDR1_DES_0(value)             (FPB_FP_PIDR1_DES_0_Msk & ((value) << FPB_FP_PIDR1_DES_0_Pos))
#define FPB_FP_PIDR1_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_PIDR1) Register Mask  */


/* -------- FPB_FP_PIDR2 : (FPB Offset: 0xFE8) ( R/ 32) FP Peripheral Identification Register 2 -------- */
#define FPB_FP_PIDR2_DES_1_Pos                _U_(0)                                         /**< (FPB_FP_PIDR2) JEP106 identification code bits[6:4] Position */
#define FPB_FP_PIDR2_DES_1_Msk                (_U_(0x7) << FPB_FP_PIDR2_DES_1_Pos)           /**< (FPB_FP_PIDR2) JEP106 identification code bits[6:4] Mask */
#define FPB_FP_PIDR2_DES_1(value)             (FPB_FP_PIDR2_DES_1_Msk & ((value) << FPB_FP_PIDR2_DES_1_Pos))
#define FPB_FP_PIDR2_JEDEC_Pos                _U_(3)                                         /**< (FPB_FP_PIDR2) JEDEC assignee value is used Position */
#define FPB_FP_PIDR2_JEDEC_Msk                (_U_(0x1) << FPB_FP_PIDR2_JEDEC_Pos)           /**< (FPB_FP_PIDR2) JEDEC assignee value is used Mask */
#define FPB_FP_PIDR2_REVISION_Pos             _U_(4)                                         /**< (FPB_FP_PIDR2) Component revision Position */
#define FPB_FP_PIDR2_REVISION_Msk             (_U_(0xF) << FPB_FP_PIDR2_REVISION_Pos)        /**< (FPB_FP_PIDR2) Component revision Mask */
#define FPB_FP_PIDR2_REVISION(value)          (FPB_FP_PIDR2_REVISION_Msk & ((value) << FPB_FP_PIDR2_REVISION_Pos))
#define FPB_FP_PIDR2_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_PIDR2) Register Mask  */


/* -------- FPB_FP_PIDR3 : (FPB Offset: 0xFEC) ( R/ 32) FP Peripheral Identification Register 3 -------- */
#define FPB_FP_PIDR3_CMOD_Pos                 _U_(0)                                         /**< (FPB_FP_PIDR3) Customer Modified Position */
#define FPB_FP_PIDR3_CMOD_Msk                 (_U_(0xF) << FPB_FP_PIDR3_CMOD_Pos)            /**< (FPB_FP_PIDR3) Customer Modified Mask */
#define FPB_FP_PIDR3_CMOD(value)              (FPB_FP_PIDR3_CMOD_Msk & ((value) << FPB_FP_PIDR3_CMOD_Pos))
#define FPB_FP_PIDR3_REVAND_Pos               _U_(4)                                         /**< (FPB_FP_PIDR3) RevAnd Position */
#define FPB_FP_PIDR3_REVAND_Msk               (_U_(0xF) << FPB_FP_PIDR3_REVAND_Pos)          /**< (FPB_FP_PIDR3) RevAnd Mask */
#define FPB_FP_PIDR3_REVAND(value)            (FPB_FP_PIDR3_REVAND_Msk & ((value) << FPB_FP_PIDR3_REVAND_Pos))
#define FPB_FP_PIDR3_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_PIDR3) Register Mask  */


/* -------- FPB_FP_CIDR0 : (FPB Offset: 0xFF0) ( R/ 32) FP Component Identification Register 0 -------- */
#define FPB_FP_CIDR0_RESETVALUE             _U_(0x0D)                                     /**<  (FPB_FP_CIDR0) FP Component Identification Register 0  Reset Value */

#define FPB_FP_CIDR0_PRMBL_0_Pos              _U_(0)                                         /**< (FPB_FP_CIDR0) CoreSight component identification preamble Position */
#define FPB_FP_CIDR0_PRMBL_0_Msk              (_U_(0xFF) << FPB_FP_CIDR0_PRMBL_0_Pos)        /**< (FPB_FP_CIDR0) CoreSight component identification preamble Mask */
#define FPB_FP_CIDR0_PRMBL_0(value)           (FPB_FP_CIDR0_PRMBL_0_Msk & ((value) << FPB_FP_CIDR0_PRMBL_0_Pos))
#define FPB_FP_CIDR0_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_CIDR0) Register Mask  */


/* -------- FPB_FP_CIDR1 : (FPB Offset: 0xFF4) ( R/ 32) FP Component Identification Register 1 -------- */
#define FPB_FP_CIDR1_RESETVALUE             _U_(0x90)                                     /**<  (FPB_FP_CIDR1) FP Component Identification Register 1  Reset Value */

