Microchip-MPLAB-Harmony/csp/apps/sercom/spi/spi_eeprom_write_read/firmware/src/packs/ATSAML10E16A_DFP/component/fpb.h
#define FPB_FP_CIDR1_PRMBL_1_Pos              _U_(0)                                         /**< (FPB_FP_CIDR1) CoreSight component identification preamble Position */
#define FPB_FP_CIDR1_PRMBL_1_Msk              (_U_(0xF) << FPB_FP_CIDR1_PRMBL_1_Pos)         /**< (FPB_FP_CIDR1) CoreSight component identification preamble Mask */
#define FPB_FP_CIDR1_PRMBL_1(value)           (FPB_FP_CIDR1_PRMBL_1_Msk & ((value) << FPB_FP_CIDR1_PRMBL_1_Pos))
#define FPB_FP_CIDR1_CLASS_Pos                _U_(4)                                         /**< (FPB_FP_CIDR1) CoreSight component class Position */
#define FPB_FP_CIDR1_CLASS_Msk                (_U_(0xF) << FPB_FP_CIDR1_CLASS_Pos)           /**< (FPB_FP_CIDR1) CoreSight component class Mask */
#define FPB_FP_CIDR1_CLASS(value)             (FPB_FP_CIDR1_CLASS_Msk & ((value) << FPB_FP_CIDR1_CLASS_Pos))
#define FPB_FP_CIDR1_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_CIDR1) Register Mask  */


/* -------- FPB_FP_CIDR2 : (FPB Offset: 0xFF8) ( R/ 32) FP Component Identification Register 2 -------- */
#define FPB_FP_CIDR2_RESETVALUE             _U_(0x05)                                     /**<  (FPB_FP_CIDR2) FP Component Identification Register 2  Reset Value */

#define FPB_FP_CIDR2_PRMBL_2_Pos              _U_(0)                                         /**< (FPB_FP_CIDR2) CoreSight component identification preamble Position */
#define FPB_FP_CIDR2_PRMBL_2_Msk              (_U_(0xFF) << FPB_FP_CIDR2_PRMBL_2_Pos)        /**< (FPB_FP_CIDR2) CoreSight component identification preamble Mask */
#define FPB_FP_CIDR2_PRMBL_2(value)           (FPB_FP_CIDR2_PRMBL_2_Msk & ((value) << FPB_FP_CIDR2_PRMBL_2_Pos))
#define FPB_FP_CIDR2_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_CIDR2) Register Mask  */


/* -------- FPB_FP_CIDR3 : (FPB Offset: 0xFFC) ( R/ 32) FP Component Identification Register 3 -------- */
#define FPB_FP_CIDR3_RESETVALUE             _U_(0xB1)                                     /**<  (FPB_FP_CIDR3) FP Component Identification Register 3  Reset Value */

#define FPB_FP_CIDR3_PRMBL_3_Pos              _U_(0)                                         /**< (FPB_FP_CIDR3) CoreSight component identification preamble Position */
#define FPB_FP_CIDR3_PRMBL_3_Msk              (_U_(0xFF) << FPB_FP_CIDR3_PRMBL_3_Pos)        /**< (FPB_FP_CIDR3) CoreSight component identification preamble Mask */
#define FPB_FP_CIDR3_PRMBL_3(value)           (FPB_FP_CIDR3_PRMBL_3_Msk & ((value) << FPB_FP_CIDR3_PRMBL_3_Pos))
#define FPB_FP_CIDR3_Msk                      _U_(0x000000FF)                                /**< (FPB_FP_CIDR3) Register Mask  */


/** \brief FPB register offsets definitions */
#define FPB_FP_CTRL_REG_OFST           (0x00)         /**< (FPB_FP_CTRL) Flash Patch Control Register Offset */
#define FPB_FP_REMAP_REG_OFST          (0x04)         /**< (FPB_FP_REMAP) Flash Patch Remap Register Offset */
#define FPB_FP_COMP_REG_OFST           (0x08)         /**< (FPB_FP_COMP) Flash Patch Comparator Register n Offset */
#define FPB_FP_LAR_REG_OFST            (0xFB0)        /**< (FPB_FP_LAR) FPB Software Lock Access Register Offset */
#define FPB_FP_LSR_REG_OFST            (0xFB4)        /**< (FPB_FP_LSR) FPB Software Lock Status Register Offset */
#define FPB_FP_DEVARCH_REG_OFST        (0xFBC)        /**< (FPB_FP_DEVARCH) FPB Device Architecture Register Offset */
#define FPB_FP_DEVTYPE_REG_OFST        (0xFCC)        /**< (FPB_FP_DEVTYPE) FPB Device Type Register Offset */
#define FPB_FP_PIDR4_REG_OFST          (0xFD0)        /**< (FPB_FP_PIDR4) FP Peripheral Identification Register 4 Offset */
#define FPB_FP_PIDR5_REG_OFST          (0xFD4)        /**< (FPB_FP_PIDR5) FP Peripheral Identification Register 5 Offset */
#define FPB_FP_PIDR6_REG_OFST          (0xFD8)        /**< (FPB_FP_PIDR6) FP Peripheral Identification Register 6 Offset */
#define FPB_FP_PIDR7_REG_OFST          (0xFDC)        /**< (FPB_FP_PIDR7) FP Peripheral Identification Register 7 Offset */
#define FPB_FP_PIDR0_REG_OFST          (0xFE0)        /**< (FPB_FP_PIDR0) FP Peripheral Identification Register 0 Offset */
#define FPB_FP_PIDR1_REG_OFST          (0xFE4)        /**< (FPB_FP_PIDR1) FP Peripheral Identification Register 1 Offset */
#define FPB_FP_PIDR2_REG_OFST          (0xFE8)        /**< (FPB_FP_PIDR2) FP Peripheral Identification Register 2 Offset */
#define FPB_FP_PIDR3_REG_OFST          (0xFEC)        /**< (FPB_FP_PIDR3) FP Peripheral Identification Register 3 Offset */
#define FPB_FP_CIDR0_REG_OFST          (0xFF0)        /**< (FPB_FP_CIDR0) FP Component Identification Register 0 Offset */
#define FPB_FP_CIDR1_REG_OFST          (0xFF4)        /**< (FPB_FP_CIDR1) FP Component Identification Register 1 Offset */
#define FPB_FP_CIDR2_REG_OFST          (0xFF8)        /**< (FPB_FP_CIDR2) FP Component Identification Register 2 Offset */
#define FPB_FP_CIDR3_REG_OFST          (0xFFC)        /**< (FPB_FP_CIDR3) FP Component Identification Register 3 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief FPB register API structure */
typedef struct
{  /* Flash Patch and Breakpoint */
  __IO  uint32_t                       FPB_FP_CTRL;     /**< Offset: 0x00 (R/W  32) Flash Patch Control Register */
  __I   uint32_t                       FPB_FP_REMAP;    /**< Offset: 0x04 (R/   32) Flash Patch Remap Register */
  __IO  uint32_t                       FPB_FP_COMP[4];  /**< Offset: 0x08 (R/W  32) Flash Patch Comparator Register n */
  __I   uint8_t                        Reserved1[0xF98];
  __O   uint32_t                       FPB_FP_LAR;      /**< Offset: 0xFB0 ( /W  32) FPB Software Lock Access Register */
  __I   uint32_t                       FPB_FP_LSR;      /**< Offset: 0xFB4 (R/   32) FPB Software Lock Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       FPB_FP_DEVARCH;  /**< Offset: 0xFBC (R/   32) FPB Device Architecture Register */
  __I   uint8_t                        Reserved3[0x0C];
  __I   uint32_t                       FPB_FP_DEVTYPE;  /**< Offset: 0xFCC (R/   32) FPB Device Type Register */
  __I   uint32_t                       FPB_FP_PIDR4;    /**< Offset: 0xFD0 (R/   32) FP Peripheral Identification Register 4 */
  __I   uint32_t                       FPB_FP_PIDR5;    /**< Offset: 0xFD4 (R/   32) FP Peripheral Identification Register 5 */
  __I   uint32_t                       FPB_FP_PIDR6;    /**< Offset: 0xFD8 (R/   32) FP Peripheral Identification Register 6 */
  __I   uint32_t                       FPB_FP_PIDR7;    /**< Offset: 0xFDC (R/   32) FP Peripheral Identification Register 7 */
  __I   uint32_t                       FPB_FP_PIDR0;    /**< Offset: 0xFE0 (R/   32) FP Peripheral Identification Register 0 */
  __I   uint32_t                       FPB_FP_PIDR1;    /**< Offset: 0xFE4 (R/   32) FP Peripheral Identification Register 1 */
  __I   uint32_t                       FPB_FP_PIDR2;    /**< Offset: 0xFE8 (R/   32) FP Peripheral Identification Register 2 */
  __I   uint32_t                       FPB_FP_PIDR3;    /**< Offset: 0xFEC (R/   32) FP Peripheral Identification Register 3 */
  __I   uint32_t                       FPB_FP_CIDR0;    /**< Offset: 0xFF0 (R/   32) FP Component Identification Register 0 */
  __I   uint32_t                       FPB_FP_CIDR1;    /**< Offset: 0xFF4 (R/   32) FP Component Identification Register 1 */
  __I   uint32_t                       FPB_FP_CIDR2;    /**< Offset: 0xFF8 (R/   32) FP Component Identification Register 2 */
  __I   uint32_t                       FPB_FP_CIDR3;    /**< Offset: 0xFFC (R/   32) FP Component Identification Register 3 */
} fpb_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML10_FPB_COMPONENT_H_ */
